{
  "project": "Vora Voice Platform",
  "branchName": "ralph/audit-03-phase-2-card-grid",
  "description": "Phase 2: Fix agent card grid vertical spacing. VirtualGrid passes gap to CSS grid (horizontal) but NOT to useVirtualizer (vertical rows touch). IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/).",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add vertical gap to VirtualGrid virtualizer",
      "description": "As a user, I want agent cards in grid view to have consistent spacing between rows, not touching each other.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/)",
        "In virtual-list.tsx around lines 237-242, find the useVirtualizer config object",
        "Add gap property to the useVirtualizer options: gap: gap (the gap prop is already passed to VirtualGrid as 24)",
        "The @tanstack/react-virtual useVirtualizer accepts a gap option that adds spacing between virtual rows",
        "After this change, vertical rows should have 24px gap matching the horizontal gap",
        "Cards should no longer touch each other vertically",
        "The estimateRowHeight (320px) may need adjustment to account for the gap -- verify visually",
        "Files: ventus-voice/frontend/src/components/ui/virtual-list.tsx",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added `gap` property to VirtualGrid's useVirtualizer config at line 242. The gap prop (default 24px from caller) was already available but only used for CSS grid horizontal spacing. Now the virtualizer also uses it for vertical row spacing, ensuring consistent 24px gap between rows. Typecheck passes."
    },
    {
      "id": "US-002",
      "title": "Normalize card height with consistent content",
      "description": "As a user, I want all agent cards in grid view to be the same height regardless of content differences.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/)",
        "In AgentsPage.tsx grid card (around lines 370-482), verify the Card already has h-full and flex flex-col classes",
        "Ensure the CardContent section (around line 447) that has mt-auto pushes content to the bottom consistently",
        "If lastDeployedAt is conditional (some agents have it, some dont), ensure a minimum height placeholder or consistent padding so cards dont jump",
        "Add a fallback for missing lastDeployedAt -- show 'Not yet deployed' in muted text instead of hiding the element entirely",
        "Files: ventus-voice/frontend/src/pages/AgentsPage.tsx",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    }
  ]
}
