{
  "project": "Vora Voice Platform",
  "branchName": "ralph/audit-01-phase-3-visual-polish",
  "description": "Phase 3: Break visual monotony with section accent colors, gradient page headers, differentiated empty states, and activation of existing animation utilities. IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/).",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define section accent CSS variables in both themes",
      "description": "As a developer, I need section-specific accent colors defined as CSS variables so each platform area has visual identity.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/)",
        "Add to :root, .dark block in index.css: --accent-agents (blue/primary), --accent-analytics (warm amber), --accent-forge (purple), --accent-deploy (green), --accent-billing (gold), --accent-settings (neutral gray)",
        "Add matching values to .light block with appropriate light-mode versions",
        "Add a comment block above the variables explaining the section-to-color mapping",
        "Values should be in HSL format without hsl() wrapper (matching existing pattern like --primary: 210 100% 80%)",
        "Files: ventus-voice/frontend/src/index.css",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added 6 section accent CSS variables (--accent-agents, --accent-analytics, --accent-forge, --accent-deploy, --accent-billing, --accent-settings) in HSL format to both :root/.dark and .light blocks in index.css. Included descriptive comment block mapping sections to colors. Typecheck passes."
    },
    {
      "id": "US-002",
      "title": "Add accent border to page headers using data-section",
      "description": "As a user, I want each section of the platform to feel visually distinct at the page level.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/)",
        "In PageLayout.tsx or page wrapper: add support for a data-section attribute or section prop",
        "Add CSS rules in index.css that style [data-section=agents] with a subtle left border or top gradient using --accent-agents",
        "Apply data-section attributes to at least 5 main pages: Dashboard (agents), AnalyticsHubPage (analytics), Forge/AgentWizard (forge), DeploymentPage or similar (deploy), SubscriptionPage (billing)",
        "The accent should be subtle -- 3px border-left or a gradient-to-transparent background tint",
        "Works in both dark and light modes",
        "Files: ventus-voice/frontend/src/components/layout/PageLayout.tsx, ventus-voice/frontend/src/index.css, section page files",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Added section prop and auto-detection via useLocation() to PageLayout.tsx. Route-to-section mapping covers 5+ main areas: agents (/dashboard, /agents), analytics (/analytics, /sessions), forge (/agents/create/interview, /forge, /agents/create), deploy (/deploy, /phone-numbers), billing (/subscription), settings (/settings). Added 6 CSS rules in index.css for main[data-section=*] with 3px left border using section accent colors at 35% opacity — works in both dark/light modes. Typecheck passes."
    },
    {
      "id": "US-003",
      "title": "Add hover-lift and card-hover animations to key surfaces",
      "description": "As a user, I want interactive cards and buttons to feel responsive with subtle hover animations.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/)",
        "Add hover-lift class to Dashboard stat cards (StatCard.tsx or equivalent)",
        "Add card-hover class to agent cards on AgentsPage",
        "Add neon-glow-hover class to primary CTA buttons on at least 3 key pages",
        "All added animations use classes already defined in animations.css -- do NOT create new keyframes",
        "Animations respect prefers-reduced-motion (already handled in animations.css)",
        "No animation is distracting or causes layout shift",
        "Files: ventus-voice/frontend/src/pages/Dashboard.tsx, ventus-voice/frontend/src/pages/AgentsPage.tsx, key CTA buttons",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Added hover-lift class to Dashboard StatCard. Added card-hover class to AgentsPage agent cards (both grid and list views). Added neon-glow-hover to 3 primary CTA buttons: Dashboard create-agent, AgentsPage create-agent, and SubscriptionPage upgrade-plan. All classes pre-existing in animations.css, no new keyframes. prefers-reduced-motion already handled. Typecheck passes."
    },
    {
      "id": "US-004",
      "title": "Add ModeToggle overflow-hidden micro-fix",
      "description": "As a user, I want the mode toggle animation to not visually overflow its container.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ (NOT root frontend/)",
        "In TopBar.tsx (line 86 area) or ModeToggle.tsx (line 36 area), add overflow-hidden to the toggle wrapper div",
        "The spring animation pill no longer peeks outside the button bounds during overshoot",
        "The toggle still functions correctly (clicking switches between Mom/God mode)",
        "Files: ventus-voice/frontend/src/components/layout/TopBar.tsx or ventus-voice/frontend/src/components/mode/ModeToggle.tsx",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": "This is the micro-fix for Finding #4 from the audit"
    }
  ]
}
