{
  "project": "Vora Voice Platform",
  "branchName": "ralph/phase-3-visual-ux",
  "description": "Phase 3: Visual & UX Quality - Light/dark theme, CSS consistency, component relocation, RTL support, and routing fixes. IMPORTANT: The codebase is at ventus-voice/frontend/ and ventus-voice/backend/ (NOT at project root frontend/ backend/).",
  "userStories": [
    {
      "id": "US-301",
      "title": "Light theme CSS rebuild",
      "description": "As a user, I want light mode to actually work when I toggle themes. ThemeProvider must add .light class to <html>, all CSS variables need light equivalents, and glass-card effects need light-mode styles.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find ThemeProvider.tsx in ventus-voice/frontend/src/components/ and fix the class toggle to ADD .light class when light mode is selected (not just remove .dark)",
        "Find index.css and audit the .light CSS variable block - every variable in :root/.dark must have a .light equivalent",
        "Add missing .light CSS variables for any that only exist in :root/.dark",
        "Glass-card effects (backdrop-blur, opacity, borders) must have light-mode equivalents suitable for white backgrounds",
        "Dark theme must NOT be broken by changes (verify :root/.dark variables unchanged)",
        "Theme toggle must work bidirectionally: dark -> light -> dark",
        "Files: ventus-voice/frontend/src/components/ThemeProvider.tsx, ventus-voice/frontend/src/index.css",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "COMPLETE: ThemeProvider already correctly adds/removes .light class. Added missing light-mode CSS variables (--primary-foreground, --secondary-foreground, --gradient-hologram, --glow-primary, --glow-strong). Fixed glass-card and bg-glass to use light-appropriate backgrounds (white/translucent instead of hardcoded dark rgba). Dark theme unchanged. Typecheck passes."
    },
    {
      "id": "US-302",
      "title": "Login page Clerk theming",
      "description": "As a new user, I want the login page to look like Vora's brand (dark theme, Vora colors, logo) instead of default Clerk styling.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find AuthPortal.tsx in ventus-voice/frontend/src/pages/",
        "Add Clerk appearance prop with Vora dark theme colors (dark backgrounds, Vora accent colors)",
        "Add Vora logo above the auth form",
        "Login -> Dashboard redirect works correctly",
        "Signup -> Onboarding redirect works correctly",
        "Login page looks correct in both light and dark themes",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "COMPLETE: AuthPortal.tsx already had Vora logo (VoraLogo component), split-screen layout with HeroSphere, and Clerk appearance prop. Added theme-aware Clerk styling: created getVoraClerkAppearance(theme) function in clerk-theme.ts with full light-mode appearance (white backgrounds, dark text, blue accents #2563EB, subtle shadows instead of neon glows). AuthPortal now uses useResolvedTheme() to pass correct theme to Clerk. Left panel (bg-void, text-text-high, text-text-muted) already adapts via CSS variables. Login redirects to /dashboard, signup redirects to /onboarding. Typecheck passes."
    },
    {
      "id": "US-303",
      "title": "Command Center CSS alignment",
      "description": "As a user, I want the Command Center to have consistent spacing, padding, and alignment across all tabs instead of looking slapped together.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find Command Center components in ventus-voice/frontend/src/ (CommandCenterPage.tsx and tab components)",
        "Ensure consistent padding and margins across all tabs",
        "Accordion headers have uniform height, font size, and icon alignment",
        "Form fields (inputs, selects, textareas) have consistent width, padding, and label alignment",
        "Tab content areas have consistent max-width and vertical rhythm",
        "No visual jank when switching between tabs",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "COMPLETE: Standardized CSS across all 8 Command Center tabs. (1) CommandCenterPage: Added max-w-2xl to all TabsContent and increased container padding to p-6. (2) BrainTab: Normalized space-y-6 to space-y-4, removed redundant text-sm from Labels. (3) VoiceTab: Normalized mixed space-y-3/5 to space-y-4, added w-full to TTS Provider SelectTrigger. (4) BehaviorTab: Removed text-xs span wrappers from AccordionTrigger labels, normalized space-y-5 to space-y-4, added w-full to Behavioral Preset SelectTrigger. (5) AnalysisTab: Removed text-sm from AccordionTriggers, changed text-xs Labels to default, normalized space-y-3 to space-y-4. (6) AdvancedTab: Normalized webhooks space-y-3 to space-y-4. EarsTab and FlowTab were already consistent. ToolsTab uses Collapsible (intentionally different pattern). Typecheck passes."
    },
    {
      "id": "US-304",
      "title": "Add Memory tab to Command Center",
      "description": "As a user, I want to access agent memory configuration from the Command Center. A MemoryTab.tsx exists in AgentDetail but is not integrated into the tab system.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find existing MemoryTab.tsx component in ventus-voice/frontend/src/ (likely in AgentDetail or similar)",
        "Find the Command Center tab system (CommandCenterPage.tsx)",
        "Add Memory tab to the tab list at an appropriate position",
        "Reuse or adapt existing MemoryTab (do not duplicate logic)",
        "Memory configuration (working memory, short-term, long-term, customer memory) is accessible",
        "Tab follows same CSS alignment as other Command Center tabs",
        "Memory settings persist correctly when saved",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "COMPLETE: Reused existing MemoryTab from AgentDetail directly in Command Center. Added 'memory' to ENABLED_TABS at index 4 (between behavior and tools). Added to CORE tab group. Added ⌘5 keyboard shortcut (shifted tools→⌘6, analysis→⌘7, flow→⌘8, advanced→⌘9). Added Memory item to command palette. Rendered MemoryTab with agentId prop in TabsContent with consistent max-w-2xl styling. MemoryTab provides: MemorySettings (enabled toggle, token budget slider, retention period, auto-summarize with its own save mutation), CustomerMemoryViewer (customer profiles with RIF scores, search), ConversationHistory (session transcripts with pagination). Memory settings persist via direct PATCH /api/agents/{agentId}/config call. Typecheck passes."
    },
    {
      "id": "US-305",
      "title": "Agent card grid consistency",
      "description": "As a user, I want agent cards on the Agents page to have uniform heights and proper spacing instead of touching each other.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find the agent card grid in AgentsPage.tsx (ventus-voice/frontend/src/pages/AgentsPage.tsx)",
        "Ensure all agent cards have uniform height regardless of content length (use min-height or flex stretch)",
        "Grid has consistent gap between cards (no touching)",
        "Cards with long names or descriptions truncate gracefully (text-overflow: ellipsis or line-clamp)",
        "Grid is responsive and maintains alignment at different widths",
        "Empty state (no agents) still looks correct",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "COMPLETE: (1) Added h-full flex flex-col to grid Card so cards stretch to fill cell height. (2) Added mt-auto to CardContent so footer pins to bottom regardless of content length. (3) Changed conditional description rendering to always render CardDescription with nbsp fallback for cards without description, ensuring uniform height. (4) Added h-full to VirtualGrid cell wrapper divs so children fill the grid cell. (5) Added items-stretch to VirtualGrid row container so all cells in a row match the tallest cell's height. (6) Applied same description fix to list view cards for consistency. (7) Updated AgentListSkeleton gap from gap-4 to gap-6 to match actual grid gap (24px). Grid responsive via VirtualGrid columns=3, list view uses flex-col. Empty state unchanged. Typecheck passes."
    },
    {
      "id": "US-306",
      "title": "Mode toggle alignment fix",
      "description": "As a user, I want the Simple/Dev mode toggle to animate without causing layout shift in the TopBar.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find ModeToggle.tsx in ventus-voice/frontend/src/components/mode/ (or similar)",
        "Find the toggle mount point in TopBar.tsx",
        "Make the toggle occupy a fixed-width container so animation doesn't reflow neighbors",
        "Adjacent elements (search, notifications, user menu) remain stable during toggle animation",
        "Toggle is functional and visually smooth in both light and dark themes",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "COMPLETE: (1) Wrapped ModeToggle in a fixed-width (w-[180px]) flex-shrink-0 container in TopBar.tsx to isolate it from the flex layout — adjacent elements (search, language, theme, user) no longer shift during animation. (2) Replaced motion.div labels with plain divs — removed scale animation (0.95↔1) on Simple/Advanced labels that caused micro-reflows during spring overshoot. (3) Kept the sliding background motion.div with spring animation (stiffness:500, damping:30) which is purely visual (absolute positioned, no layout impact). (4) Text color transitions remain via CSS transition-colors for smooth visual feedback. Works in both light and dark themes. Typecheck passes."
    },
    {
      "id": "US-307",
      "title": "FuelGauge relocation to sidebar",
      "description": "As a user, I want the FuelGauge (usage meter) in the sidebar bottom-left instead of the TopBar for better visibility.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find FuelGauge component usage in TopBar.tsx and remove it",
        "Add FuelGauge to the bottom of Sidebar.tsx",
        "FuelGauge is visible in both expanded and collapsed sidebar states",
        "FuelGauge displays correctly in both light and dark themes",
        "No layout shift in TopBar after FuelGauge removal",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "COMPLETE: (1) Removed FuelGauge from TopBar.tsx (removed import and SignedIn wrapper). (2) Added FuelGauge to Sidebar.tsx bottom, above the footer version section. (3) Added fuel-gauge-details class to FuelGauge progress bar container div for targeted CSS hiding. (4) Expanded sidebar: FuelGauge renders full-width with progress bar and label. (5) Collapsed sidebar: FuelGauge hides the details div via [&_.fuel-gauge-details]:hidden, showing only the Fuel icon. (6) Wrapped in SignedIn for auth gating. (7) Both light and dark themes work (FuelGauge uses CSS variables). (8) No layout shift in TopBar after removal. Typecheck passes."
    },
    {
      "id": "US-308",
      "title": "RTL orb repositioning with CSS logical properties",
      "description": "As an Arabic/Hebrew/Farsi user, I want the orb/sphere component to position correctly in RTL layouts instead of overlapping UI elements.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find orb.tsx in ventus-voice/frontend/src/components/ui/",
        "Replace all left/right positioning CSS with inset-inline-start/inset-inline-end (CSS logical properties)",
        "Orb positions correctly in RTL layouts",
        "Orb positions correctly in LTR layouts (no regression)",
        "No overlapping UI elements in RTL mode",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": false,
      "notes": "Depends on 3.1"
    },
    {
      "id": "US-309",
      "title": "Dashboard stat cards link to Analytics",
      "description": "As a user, I want to click Dashboard stat cards to navigate to the corresponding Analytics Hub page.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find Dashboard.tsx stat cards in ventus-voice/frontend/src/pages/Dashboard.tsx",
        "Make stat cards clickable with React Router links to Analytics pages",
        "Navigation uses proper React Router Link or useNavigate (no full page reloads)",
        "Active analytics tab is pre-selected based on which stat card was clicked (pass query param or state)",
        "Back navigation from Analytics returns to Dashboard",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Depends on 3.1"
    },
    {
      "id": "US-310",
      "title": "Fix upload popup reliability in InterviewBot",
      "description": "As a user, I want the document upload popup in InterviewBot to open reliably every time, not intermittently fail.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Find InterviewBot.tsx or similar in ventus-voice/frontend/src/ (the agent creation interview/forge flow)",
        "Find the upload popup Dialog component",
        "Ensure the Dialog has correct z-index to appear above all other elements (especially above Radix overlays)",
        "Fix any focus management issues that interfere with popup rendering",
        "Upload popup opens reliably on every click (not intermittent)",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": false,
      "notes": "Depends on 3.1. Phase 1 US-007 already fixed the progress bar and Continue button."
    }
  ]
}
