{
  "project": "Vora Voice Platform",
  "branchName": "ralph/audit-06-phase-2-minimal-publish",
  "description": "Phase 2: Implement minimal flow publish — validate, set flag, show published state. IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/).",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add publish endpoint and wire handlePublish to real backend call",
      "description": "As a user, I want the Publish button to actually publish my flow so it becomes the active version.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/",
        "Check the flow model in ventus-voice/backend/prisma/schema.prisma — look for the Flow or AgentFlow model that stores flow data",
        "If the flow model already has isPublished/publishedAt fields, use them. If not, the publish action should set isActive=true and update updatedAt timestamp (or whatever existing field marks the flow as the live version)",
        "In ventus-voice/backend/src/routes/flow.routes.ts, check if a POST /:agentId/flow/publish endpoint already exists",
        "If no publish endpoint exists: add one that (1) runs the existing validation logic, (2) if valid, updates the flow record to mark it as published/active, (3) returns { success: true, publishedAt: timestamp }",
        "If a publish endpoint already exists, verify it works correctly",
        "In ventus-voice/frontend/src/pages/FlowStudioPage.tsx, find handlePublish (the one with the TODO comment about actual publish logic)",
        "Replace the stub toast.success with an actual API call to POST /api/agents/:agentId/flow/publish",
        "On success: show toast.success('Flow published successfully') with the publishedAt timestamp",
        "On validation failure: show toast.error with the validation errors (this part may already work)",
        "On API error: show toast.error with the error message",
        "Add a visual indicator in the Flow Studio UI that shows whether the flow is published or in draft state — a small badge or text near the save status area",
        "Files: ventus-voice/backend/src/routes/flow.routes.ts, ventus-voice/frontend/src/pages/FlowStudioPage.tsx",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Added POST /:agentId/flow/publish endpoint in flow.routes.ts that validates the flow using existing validateFlow(), then updates isActive+updatedAt. Wired handlePublish in FlowStudioPage.tsx to call the API with loading state, error handling, and success toast with publishedAt timestamp. Added Published/Draft badge next to save status in top bar. All pre-existing TS errors unrelated to changes; frontend typecheck passes clean."
    }
  ]
}
