{
  "project": "Vora Voice Platform",
  "branchName": "ralph/locally-running-dashboard-phase-3",
  "description": "Phase 3: Documentation & Onboarding - Create LOCAL_DEVELOPMENT.md with setup guide, troubleshooting, and architecture overview. IMPORTANT: The codebase is at ventus-voice/frontend/ and ventus-voice/backend/ (NOT at project root frontend/ backend/).",
  "userStories": [
    {
      "id": "US-L09",
      "title": "Create LOCAL_DEVELOPMENT.md Guide",
      "description": "As a new developer, I want comprehensive documentation for running the Vora dashboard locally so I can go from clone to running in 5 minutes.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Create ventus-voice/LOCAL_DEVELOPMENT.md",
        "Quick Start section at the top: 5-6 shell commands from clone to running (cd ventus-voice, npm run install:all, npm run setup, npm run local)",
        "Prerequisites section: Node.js 20+, PostgreSQL 15+ (or Docker), npm, Git",
        "Environment Variables section: table with columns Name, Required, Default, Description for all vars in both frontend/.env and backend/.env",
        "Bare Metal Setup section: step-by-step for manual setup (install deps, create DB, migrate, seed, start backend, start frontend)",
        "Docker Setup section: how to use docker-compose.local.yml (docker compose -f docker-compose.local.yml up)",
        "Architecture Overview section: ASCII diagram showing: Browser -> Frontend (localhost:8080) -> Backend API (localhost:3001) -> PostgreSQL (localhost:5432), and external services (Clerk Auth, LiveKit Cloud, OpenAI/Google APIs)",
        "Available Scripts section: table of all npm run commands from ventus-voice/package.json with descriptions",
        "Feature Availability Matrix section: table showing which features work with which API keys (e.g., Voice calls need LIVEKIT keys, Brand analysis needs GOOGLE_API_KEY, etc.)",
        "Seed Data section: describe what the seed script creates (1 org, 1 user, 3 agents, 5 sessions, credit packs, pricing)",
        "Troubleshooting section with 10+ common issues: CORS errors, 401 Unauthorized, DB connection failed, migration errors, port in use, blank page, WebSocket failed, Prisma client not generated, missing env vars, Node version mismatch. Each has symptom, cause, fix command",
        "Nuclear Reset section: complete wipe and rebuild (npm run db:reset, rm -rf node_modules, reinstall)",
        "No emoji in the document"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Created ventus-voice/LOCAL_DEVELOPMENT.md with all required sections: Quick Start (6 commands), Prerequisites table, Environment Variables tables (backend + frontend), Bare Metal Setup (6 steps), Docker Setup with docker-compose.local.yml, ASCII Architecture Overview with external services, Available Scripts tables (root + backend), Feature Availability Matrix, Seed Data table (1 org, 1 user, 3 agents, 5 sessions, 3 credit packs, 6 pricing entries), Troubleshooting with 11 issues (CORS, 401, DB connection, migrations, port in use, blank page, WebSocket, Prisma client, missing env, Node version, Redis), Nuclear Reset section. No emoji used."
    },
    {
      "id": "US-L10",
      "title": "Update Backend README with Local Dev Reference",
      "description": "As a developer, I want the backend README to reference the new local development guide and list database commands.",
      "acceptanceCriteria": [
        "IMPORTANT: Code is at ventus-voice/frontend/src/ and ventus-voice/backend/src/ (NOT root frontend/ or backend/)",
        "Read the existing ventus-voice/backend/README.md",
        "Add a 'Local Development' section that links to ../LOCAL_DEVELOPMENT.md for full setup guide",
        "Add a 'Database Commands' subsection listing: db:setup-local, db:reset-local, db:seed-local, db:generate, db:migrate, db:studio with brief descriptions",
        "Add a 'Quick Start (Backend Only)' subsection: npm install, create .env from .env.example, npm run db:setup-local, npm run dev",
        "Keep ALL existing content intact - only add new sections",
        "No emoji in additions"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    }
  ]
}
